Repository: openiddict/core
Catalog: src/OpenIddict.Abstractions/Resources/xlf/OpenIddictResources.*.xlf
Languages: nl

# ID2000
source: The security token is missing.
nl: Het beveiligingstoken ontbreekt.

# ID2001
source: The specified authorization code is invalid.
nl: De opgegeven autorisatiecode is ongeldig.

# ID2002
source: The specified device code is invalid.
nl: De opgegeven toestelcode is ongeldig.

# ID2003
source: The specified refresh token is invalid.
nl: Het opgegeven vernieuwingstoken is ongeldig.

# ID2004
source: The specified token is invalid.
nl: Het opgegeven token is ongeldig.

# ID2005
source: The specified token is not an authorization code.
nl: Het opgegeven token is geen autorisatiecode.

# ID2006
source: The specified token is not an device code.
nl: Het opgegeven token is geen toestelcode.

# ID2007
source: The specified token is not a refresh token.
nl: Het opgegeven token is geen vernieuwingstoken.

# ID2008
source: The specified token is not an access token.
nl: Het opgegeven token is geen toegangstoken.

# ID2009
source: The specified identity token is invalid.
nl: Het opgegeven identiteitstoken is ongeldig.

# ID2010
source: The specified authorization code has already been redeemed.
nl: De opgegeven autorisatiecode is al ingewisseld.

# ID2011
source: The specified device code has already been redeemed.
nl: De opgegeven toestelcode is al ingewisseld.

# ID2012
source: The specified refresh token has already been redeemed.
nl: Het opgegeven vernieuwingstoken is al ingewisseld.

# ID2013
source: The specified token has already been redeemed.
nl: Het opgegeven token is al ingewisseld.

# ID2014
source: The authorization has not been granted yet by the end user.
nl: De autorisatie is nog niet verleend door de eindgebruiker.

# ID2015
source: The authorization was denied by the end user.
nl: De autorisatie is geweigerd door de eindgebruiker.

# ID2016
source: The specified authorization code is no longer valid.
nl: De opgegeven autorisatiecode is niet langer geldig.

# ID2017
source: The specified device code is no longer valid.
nl: De opgegeven toestelcode is niet meer geldig.

# ID2018
source: The specified refresh token is no longer valid.
nl: Het opgegeven vernieuwingstoken is niet langer geldig.

# ID2019
source: The specified token is no longer valid.
nl: Het opgegeven token is niet langer geldig.

# ID2020
source: The authorization associated with the authorization code is no longer valid.
nl: De autorisatie die aan de autorisatiecode is gekoppeld, is niet langer geldig.

# ID2021
source: The authorization associated with the device code is no longer valid.
nl: De autorisatie die aan de toestelcode is gekoppeld, is niet langer geldig.

# ID2022
source: The authorization associated with the refresh token is no longer valid.
nl: De autorisatie die aan het vernieuwingstoken is gekoppeld, is niet langer geldig.

# ID2023
source: The authorization associated with the token is no longer valid.
nl: De autorisatie die aan het token is gekoppeld, is niet langer geldig.

# ID2024
source: The token request was rejected by the authentication server.
nl: Het tokenverzoek is afgewezen door de authenticatieserver.

# ID2025
source: The user information access demand was rejected by the authentication server.
nl: Het verzoek om toegang tot gebruikersinformatie is afgewezen door de authenticatieserver.

# ID2026
source: The specified user code is no longer valid.
nl: De opgegeven gebruikerscode is niet langer geldig.

# ID2028
source: The '{0}' parameter is not supported.
nl: De parameter '{0}' wordt niet ondersteund.

# ID2029
source: The mandatory '{0}' parameter is missing.
nl: De verplichte parameter '{0}' ontbreekt.

# ID2030
source: The '{0}' parameter must be a valid absolute URL.
nl: De parameter '{0}' moet een geldige absolute URL zijn.

# ID2031
source: The '{0}' parameter must not include a fragment.
nl: De parameter '{0}' mag geen fragment bevatten.

# ID2032
source: The specified '{0}' is not supported.
nl: De opgegeven '{0}' wordt niet ondersteund.

# ID2033
source: The specified '{0}'/'{1}' combination is invalid.
nl: De opgegeven combinatie '{0}' / '{1}' is ongeldig.

# ID2034
source: The mandatory '{0}' scope is missing.
nl: De verplichte scope '{0}' ontbreekt.

# ID2035
source: The '{0}' scope is not allowed.
nl: De scope '{0}' is niet toegestaan.

# ID2036
source: The client identifier cannot be null or empty.
nl: Het client-ID mag niet null of leeg zijn.

# ID2037
source: The '{0}' parameter cannot be used without '{1}'.
nl: De parameter '{0}' kan niet worden gebruikt zonder '{1}'.

# ID2038
source: The status cannot be null or empty.
nl: De status mag niet null of leeg zijn.

# ID2039
source: Scopes cannot be null or empty.
nl: Scope mag niet null of leeg zijn.

# ID2040
source: The '{0}' and '{1}' parameters can only be used with a response type containing '{2}'.
nl: De parameters '{0}' en '{1}' kunnen alleen worden gebruikt met een reactietype dat '{2}' bevat.

# ID2041
source: The specified '{0}' is not allowed when using PKCE.
nl: De opgegeven '{0}' is niet toegestaan bij gebruik van PKCE.

# ID2042
source: Scopes cannot contain spaces.
nl: Scope mag geen spaties bevatten.

# ID2043
source: The specified '{0}' is not valid for this client application.
nl: De opgegeven '{0}' is niet geldig voor deze clienttoepassing.

# ID2044
source: The scope name cannot be null or empty.
nl: De naam van de scope mag niet null of leeg zijn.

# ID2045
source: The scope name cannot contain spaces.
nl: De naam van de scope mag geen spaties bevatten.

# ID2046
source: This client application is not allowed to use the authorization endpoint.
nl: Deze clienttoepassing mag het autorisatie-eindpunt niet gebruiken.

# ID2047
source: The client application is not allowed to use the authorization code flow.
nl: De clienttoepassing mag de autorisatiecodestroom niet gebruiken.

# ID2048
source: The client application is not allowed to use the implicit flow.
nl: De clienttoepassing mag de impliciete stroom niet gebruiken.

# ID2049
source: The client application is not allowed to use the hybrid flow.
nl: De clienttoepassing mag de hybride stroom niet gebruiken.

# ID2051
source: This client application is not allowed to use the specified scope.
nl: Deze clienttoepassing mag de opgegeven scope niet gebruiken.

# ID2052
source: The specified '{0}' is invalid.
nl: De opgegeven '{0}' is ongeldig.

# ID2053
source: The '{0}' parameter is not valid for this client application.
nl: De parameter '{0}' is niet geldig voor deze clienttoepassing.

# ID2054
source: The '{0}' parameter required for this client application is missing.
nl: De parameter '{0}' die vereist is voor deze clienttoepassing, ontbreekt.

# ID2055
source: The specified client credentials are invalid.
nl: De opgegeven clientreferenties zijn ongeldig.

# ID2056
source: This client application is not allowed to use the device endpoint.
nl: Deze clienttoepassing mag het toesteleindpunt niet gebruiken.

# ID2057
source: The '{0}' and '{1}' parameters are required when using the client credentials grant.
nl: De parameters '{0}' en '{1}' zijn vereist bij het gebruik van de toekenning van clientreferenties.

# ID2058
source: The '{0}' parameter is required when using the device code grant.
nl: De parameter '{0}' is vereist bij gebruik van de toestelcodetoekenning.

# ID2059
source: The mandatory '{0}' and/or '{1}' parameters are missing.
nl: De verplichte '{0}' en / of '{1}' parameters ontbreken.

# ID2060
source: A scope with the same name already exists.
nl: Er bestaat al een scope met dezelfde naam.

# ID2063
source: This client application is not allowed to use the token endpoint.
nl: Deze clienttoepassing mag het tokeneindpunt niet gebruiken.

# ID2064
source: This client application is not allowed to use the specified grant type.
nl: Deze clienttoepassing mag het opgegeven toekenningstype niet gebruiken.

# ID2065
source: The client application is not allowed to use the '{0}' scope.
nl: De clienttoepassing mag de scope '{0}' niet gebruiken.

# ID2066
source: The specified authorization code cannot be used without sending a client identifier.
nl: De opgegeven autorisatiecode kan niet worden gebruikt zonder een client-ID te verzenden.

# ID2067
source: The specified device code cannot be used without sending a client identifier.
nl: De opgegeven toestelcode kan niet worden gebruikt zonder een client-ID te verzenden.

# ID2068
source: The specified refresh token cannot be used without sending a client identifier.
nl: Het opgegeven vernieuwingstoken kan niet worden gebruikt zonder een client-ID te verzenden.

# ID2069
source: The specified authorization code cannot be used by this client application.
nl: De opgegeven autorisatiecode kan niet worden gebruikt door deze clienttoepassing.

# ID2070
source: The specified device code cannot be used by this client application.
nl: De opgegeven toestelcode kan niet worden gebruikt door deze clienttoepassing.

# ID2071
source: The specified refresh token cannot be used by this client application.
nl: Het opgegeven vernieuwingstoken kan niet worden gebruikt door deze clienttoepassing.

# ID2072
source: The specified '{0}' parameter doesn't match the client redirection address the authorization code was initially sent to.
nl: De opgegeven parameter '{0}' komt niet overeen met het omleidingsadres van de client waarnaar de autorisatiecode oorspronkelijk was verzonden.

# ID2073
source: The '{0}' parameter cannot be used when no '{1}' was specified in the authorization request.
nl: De parameter '{0}' kan niet worden gebruikt als er geen '{1}' is opgegeven in het autorisatieverzoek.

# ID2074
source: The '{0}' parameter is not valid in this context.
nl: De parameter '{0}' is in deze context niet geldig.

# ID2075
source: This client application is not allowed to use the introspection endpoint.
nl: Deze clienttoepassing mag het introspectie-eindpunt niet gebruiken.

# ID2076
source: The specified token cannot be introspected.
nl: Er kan geen introspectie worden uitgevoerd met het opgegeven token.

# ID2077
source: The client application is not allowed to introspect the specified token.
nl: De clienttoepassing mag geen introspectie uitvoeren met het opgegeven token.

# ID2078
source: This client application is not allowed to use the revocation endpoint.
nl: Deze clienttoepassing mag het intrekkings-eindpunt niet gebruiken.

# ID2079
source: This token cannot be revoked.
nl: Dit token kan niet worden ingetrokken.

# ID2080
source: The client application is not allowed to revoke the specified token.
nl: De clienttoepassing mag het opgegeven token niet intrekken.

# ID2081
source: The mandatory '{0}' header is missing.
nl: De verplichte '{0}' koptekst ontbreekt.

# ID2082
source: The specified '{0}' header is invalid.
nl: De opgegeven '{0}' koptekst is ongeldig.

# ID2083
source: This server only accepts HTTPS requests.
nl: Deze server accepteert alleen HTTPS-verzoeken.

# ID2084
source: The specified HTTP method is not valid.
nl: De opgegeven HTTP-methode is niet geldig.

# ID2085
source: A token with the same reference identifier already exists.
nl: Er bestaat al een token met dezelfde referentie-ID.

# ID2086
source: The token type cannot be null or empty.
nl: Het token type mag niet null of leeg zijn.

# ID2087
source: Multiple client credentials cannot be specified.
nl: Er kunnen niet meerdere clientreferenties worden opgegeven.

# ID2088
source: The issuer associated to the specified token is not valid.
nl: De uitgever die aan het opgegeven token is gekoppeld, is niet geldig.

# ID2089
source: The specified token is not of the expected type.
nl: Het opgegeven token is niet van het verwachte type.

# ID2090
source: The signing key associated to the specified token was not found.
nl: De ondertekeningssleutel die aan het opgegeven token is gekoppeld, is niet gevonden.

# ID2091
source: The signature associated to the specified token is not valid.
nl: De handtekening die aan het opgegeven token is gekoppeld, is niet geldig.

# ID2092
source: This resource server is currently unavailable.
nl: Deze bronserver is momenteel niet beschikbaar.

# ID2093
source: The specified token doesn't contain any audience.
nl: Het opgegeven token bevat geen doelgroep.

# ID2094
source: The specified token cannot be used with this resource server.
nl: Het opgegeven token kan niet worden gebruikt met deze bronserver.

# ID2095
source: The user represented by the token is not allowed to perform the requested action.
nl: De gebruiker die wordt vertegenwoordigd door het token, mag de gevraagde actie niet uitvoeren.

# ID2096
source: No issuer could be found in the server configuration.
nl: Er is geen uitgever gevonden in de serverconfiguratie.

# ID2097
source: A server configuration containing an invalid issuer was returned.
nl: Er is een serverconfiguratie met een ongeldige uitgever geretourneerd.

# ID2098
source: The issuer returned in the server configuration is not valid.
nl: De uitgever die in de serverconfiguratie is geretourneerd, is niet geldig.

# ID2099
source: No JWKS endpoint could be found in the server configuration.
nl: Er is geen JWKS-eindpunt gevonden in de serverconfiguratie.

# ID2100
source: A server configuration containing an invalid JWKS endpoint URL was returned.
nl: Er is een serverconfiguratie met een ongeldige JWKS-eindpunt URL geretourneerd.

# ID2101
source: A server configuration containing an invalid introspection endpoint URL was returned.
nl: Er is een serverconfiguratie met een ongeldige introspectie-eindpunt URL geretourneerd.

# ID2102
source: The JWKS document didn't contain a valid '{0}' node with at least one key.
nl: Het JWKS-document bevat geen geldig '{0}' element met ten minste één sleutel.

# ID2103
source: A JWKS response containing an unsupported key was returned.
nl: Er is een JWKS-antwoord geretourneerd met een niet-ondersteunde sleutel.

# ID2104
source: A JWKS response containing an invalid key was returned.
nl: Er is een JWKS-antwoord met een ongeldige sleutel geretourneerd.

# ID2105
source: The mandatory '{0}' parameter couldn't be found in the introspection response.
nl: De verplichte parameter '{0}' is niet gevonden in het introspectie-antwoord.

# ID2106
source: The token was rejected by the remote authentication server.
nl: Het token werd geweigerd door de externe authenticatieserver.

# ID2107
source: The '{0}' claim is malformed or isn't of the expected type.
nl: De claim '{0}' heeft een onjuiste indeling of is niet van het verwachte type.

# ID2108
source: An introspection response containing a malformed issuer was returned.
nl: Het introspectie-antwoord bevat een onjuiste uitgever.

# ID2109
source: The issuer returned in the introspection response is not valid.
nl: De uitgever die is geretourneerd in het introspectie-antwoord is niet geldig.

# ID2110
source: The type of the introspected token doesn't match the expected type.
nl: Het type van het geintrospecteerde token komt niet overeen met het verwachte type.

# ID2111
source: An application with the same client identifier already exists.
nl: Er bestaat al een applicatie met dezelfde client-ID.

# ID2112
source: Only confidential, hybrid or public applications are supported by the default application manager.
nl: Alleen vertrouwelijke, hybride of openbare applicaties worden ondersteund door de standaard applicatiebeheerder.

# ID2113
source: The client secret cannot be null or empty for a confidential application.
nl: Het clientgeheim mag niet leeg of leeg zijn voor een vertrouwelijke toepassing.

# ID2114
source: A client secret cannot be associated with a public application.
nl: Een clientgeheim kan niet worden gekoppeld aan een openbare toepassing.

# ID2115
source: Callback URLs cannot contain a fragment.
nl: Callback URL's mogen geen fragment bevatten.

# ID2116
source: The authorization type cannot be null or empty.
nl: Het autorisatietype mag niet null of leeg zijn.

# ID2117
source: The specified authorization type is not supported by the default token manager.
nl: Het opgegeven autorisatietype wordt niet ondersteund door de standaard tokenmanager.

# ID2118
source: The client type cannot be null or empty.
nl: Het client type mag niet null of leeg zijn.

# ID2119
source: Callback URLs cannot be null or empty.
nl: Callback URL's mogen niet null of leeg zijn.

# ID2120
source: Callback URLs must be valid absolute URLs.
nl: Callback URL's moeten geldige absolute URL's zijn.

# ID8000
source: Removes orphaned tokens and authorizations from the database.
nl: Verwijdert ongebruikte tokens en autorisaties uit de database.

# ID8001
source: Starts the scheduled task at regular intervals.
nl: Start de geplande taak op regelmatige momenten.
